tutorials/multiphase/compressibleInterDyMFoam/laminar/sphereDrop/0.orig/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.walter;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }

    innerAMI
    {
        type            cyclicAMI;
        value           uniform 0;
    }

    outerAMI
    {
        type            cyclicAMI;
        value           uniform 0;
    }

    top
    {
        type            zeroGradient;
    }

    bottom
    {
        type            zeroGradient;
    }

    farFieldWall
    {
        type            zeroGradient;
    }

    sphere
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
